Revit 2027 API
DimensionType.CanHaveEqualityFormula Method
 Checks whether this DimensionType can have an equality formula.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanHaveEqualityFormula()
Public Function CanHaveEqualityFormula As Boolean
public:
bool CanHaveEqualityFormula()
member CanHaveEqualityFormula : unit -> bool
Return Value
Boolean
 True when the DimensionType is continuous linear or angular, false otherwise
Remarks
 Equality formulas can be used for continuous linear or angular dimension types.
See Also
Reference
DimensionType Class
Autodesk.Revit.DB Namespace